## Required Libraries

In [428]:
import pandas as pd

#leer csv

actor=pd.read_csv('../data/actor.csv')
category=pd.read_csv('../data/category.csv')
film=pd.read_csv('../data/film.csv')
inventory=pd.read_csv('../data/inventory.csv')
language=pd.read_csv('../data/language.csv')
old_HDD=pd.read_csv('../data/old_HDD.csv')
rental=pd.read_csv('../data/rental.csv')

### Comienzo limpiando cada uno de los archivos csv

#### actor.csv

In [429]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [430]:
actor=actor.drop('last_update', axis=1)

In [431]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int64
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int64(1), object(2)
memory usage: 4.8+ KB

#### category.csv

In [432]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [433]:
category=category.drop('last_update', axis=1)

#### film.csv

In [434]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [435]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [436]:
film=film.drop('original_language_id', axis=1)
film=film.drop('last_update', axis=1)

In [437]:
film['release_year'].unique()

array([2006], dtype=int64)

In [438]:
#todas las peliculas salieron en 2006? 
#este dato está mal
#me fumo la columna? Si

film=film.drop('release_year', axis=1)

#### inventory.csv

In [439]:

inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [440]:
#el inventario me está diciendo cuantas unidades tengo de cada peli
#voy a eliminar store_id

inventory = inventory.drop('store_id', axis=1)
inventory=inventory.drop('last_update', axis=1)

In [441]:
inventory['inventory_id'].max()

1000

In [442]:
inventory['film_id'].max()

223

In [443]:
film['film_id'].max()

1000

In [444]:
rental['inventory_id'].max()

4581

In [445]:
# al sacar los valores máximos de estas columnas me doy cuenta de que en inventory están solo las primeras 223 peliculas
# y el inventory id llega a 1000
#sin embargo en rental el invebtory id llega 4581

In [446]:
film.iloc[1:223];
#me doy cuenta de que en el inventario solamente aparecen las peliculas de la A a la D, por lo tanto está incompleto

#### language.csv

In [447]:
language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [448]:
language=language.drop('last_update', axis=1)

In [449]:
#para hacer la relación entre language y film debería crear una tabla nueva
#ya que la relación es many to many 

#resulta que en los VHS no se puede elegir el idioma es por eso que no voy a utilizar 
#la tabla language y en la tabla film habrá una única columna que represente en qué 
#idioma está la pelicula

In [450]:
# como el unico valor de language id en film es 1 que corresponde al inglés,
#cambio el 1 por English
film['language_id'] = film['language_id'].replace({1: 'English'})

#### rental.csv

In [451]:
rental

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
995,997,2005-05-31 00:08:25,4243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,998,2005-05-31 00:16:57,3395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,999,2005-05-31 00:25:10,4433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,1000,2005-05-31 00:25:56,1774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,1001,2005-05-31 00:46:31,1498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

In [452]:
#en rental en vez de inventory_id quiero me diga el film_id 
#en rental quiero que me meta una columna que sea film_id 
#para cuando coincidan el inventory_id de rental y el inventory_id de inventory

rental = rental.merge(inventory[['inventory_id', 'film_id']], on='inventory_id', how='left')

In [453]:
inventory.film_id.value_counts().index.sort_values()

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       212, 213, 214, 215, 216, 218, 219, 220, 222, 223],
      dtype='int64', name='film_id', length=207)

In [454]:
rental.film_id.value_counts().index.sort_values()

Index([  1.0,   4.0,   5.0,   6.0,   8.0,  11.0,  12.0,  15.0,  16.0,  17.0,
       ...
       206.0, 208.0, 209.0, 210.0, 212.0, 213.0, 216.0, 218.0, 219.0, 220.0],
      dtype='float64', name='film_id', length=135)

In [455]:
rental.film_id.equals(inventory.film_id)

False

### mediante estos cálculos confirmo que se hicieron rentals de otras peliculas cuyo nombre no sabemos ya que el inventario está incompleto

In [456]:
rental['film_id'].isnull().sum()

788

In [457]:
rental.shape

(1000, 8)

In [458]:
rental = rental.drop('staff_id', axis=1)

In [459]:
#como de aquí me interesa saber que peliculas se alquilaron aquellas donde el film_id sea nulo me las cargo 
#de esta forma solamente manejo datos que conozco

rental.dropna(subset=['film_id'], inplace=True)

In [460]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,last_update,film_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,2006-02-15 21:30:53,80.0
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2006-02-15 21:30:53,86.0
16,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,2006-02-15 21:30:53,181.0
20,21,2005-05-25 01:59:46,146,388,2005-05-26 01:01:46,2006-02-15 21:30:53,31.0
21,22,2005-05-25 02:19:23,727,509,2005-05-26 04:52:23,2006-02-15 21:30:53,159.0

In [461]:
#ahora que ya tengo a que pelicula pertenece cada rental no necesito el inventory_id
rental = rental.drop('inventory_id', axis=1)

In [462]:
#ahora vuelvo a la tabla inventory y la estructuro de tal forma que para cada pelicula 
#me diga cuantas unidades hay, me parece más lógico para el entendimiento del negocio
#teniendo en cuenta que solo hay un store

inventory.head()

   inventory_id  film_id
0             1        1
1             2        1
2             3        1
3             4        1
4             5        1

In [463]:
inventory = inventory['film_id'].value_counts().reset_index()
inventory = inventory.rename(columns={'count': 'qty'})
inventory['inventory_id'] = range(len(inventory))
#cambio el orden de las columnas
inventory = inventory[['inventory_id', 'film_id', 'qty']]
inventory.head()

   inventory_id  film_id  qty
0             0        1    8
1             1      127    8
2             2       73    8
3             3      174    8
4             4       86    8

In [464]:
#añado una o dos columnas para saber la ubicacion exacta de la peli dentro del almacen?
inventory['location']=''

In [465]:
inventory.head()

   inventory_id  film_id  qty location
0             0        1    8
1             1      127    8
2             2       73    8
3             3      174    8
4             4       86    8

#### old_HDD.csv

In [466]:
old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [467]:
old_HDD.release_year.unique()
#me fumo aquí también release_year para crear bien la relación

old_HDD=old_HDD.drop('release_year', axis=1)

In [468]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes

##### A partir de old_HDD voy a sacar las relaciones, entonces la comparo con el dataframe de film y aquellas peliculas que coincida el titulo hago un merge por esa columna y me crea una nueva columna con las relaciones

In [469]:

#El left lo que hace es mantener todas las filas de film incluso cuando no hay coincidencia
film = film.merge(old_HDD, on='title', how='left')

#como se han añadido todas columnas quito las que no me interesan que son first_name, last_name y release year
film = film.drop(['first_name', 'last_name'], axis=1)

#elimino duplicados aparecidos por el left join
film = film.drop_duplicates()

In [470]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",NaN
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes,NaN

In [471]:
#film.dropna(subset=['category_id'], inplace=True)
film.isnull().sum()

film_id               0
title                 0
description           0
language_id           0
rental_duration       0
rental_rate           0
length                0
replacement_cost      0
rating                0
special_features      0
category_id         386
dtype: int64

In [472]:
film.fillna(' ', inplace=True)

In [473]:
#como todo parece estar dandome problemas voy a meter un -1 para aquellas pelis 
#cuyo genero no conozco y luego paso a entero

film['category_id'] = film['category_id'].replace(' ', -1).astype(int)

### Voy a crear una nueva tabla de la relación many to many de actores y peliculas

#### actor_id de actor.csv cuando first_name de actor.csv coincida con first_name de old_HDD, y film_id de film.csv cuando title de film.csv coincida con title de old_HDD,
#### utilizo el método merge() varias veces para unir los DataFrames.

In [474]:

# Unimos los DataFrames actor y old_HDD por la columna 'first_name' y 'last_name'
merged1 = old_HDD.merge(actor, on=['first_name', 'last_name'], how='left')


# Unimos los DataFrames merged1 y film por la columna 'title'
merged2 = merged1.merge(film, on='title', how='left')

# Seleccionamos solo las columnas que deseamos mantener en el nuevo DataFrame
actor_film = merged2[['actor_id', 'film_id']]

In [475]:
actor_film

     actor_id  film_id
0           1        1
1           1       23
2           1       25
3           1      106
4           1      140
..        ...      ...
995        39      168
996        39      203
997        39      222
998        39      290
999        39      293

[1000 rows x 2 columns]

## Nueva tabla llamada customer

In [476]:
#suponiendo que el negocio parte de sus clientes ya existentes 
#partimos de un número aproximado de 600 customers

customer = pd.DataFrame({'customer_id':range(1,600)})
customer['first_name']=''
customer['last_name']=''
customer['phone_number']=''
customer['email']=''
customer['adress']=''
customer['membership']=''

### voy a meter en la tabla film directamente la categoria de la pelicula así me deshago de la tabla category

category.head

In [477]:
category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [478]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",-1
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes,-1

In [479]:
merged = pd.merge(film, category, on='category_id', how='left')


# crear una nueva columna en el DataFrame "merged" con el "name" de la categoría
#merged['category'] = merged['name']

In [480]:
merged = merged.sort_values('film_id')
merged.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id,name
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6,Documentary
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11,Horror
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6,Documentary
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",-1,NaN
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes,-1,NaN

ahora que ya lo tengo pienso como relleno el -1 o los valores nulos